<?php

return [
    'login' => [
        'sing_in'    => 'تسجيل الدخول',
        'sing_up'    => 'اشتراك',
        'login' => 'تسجيل الدخول',
        'logout' => 'تسجيل خروج',
        'register'    => 'اشتراك',
        'welcome-text' => 'ارجوك سجل دخولك الى حسابك و ابدا الجلسة',
        'welcome-message' => ' مرحبا بكم في ادارة eldoaa',
        'create-password' => 'انشىء كلمة مرور جديدة الان',
        'login-text' => 'سجل لبدء جلستك',
        'remember_me' => 'تتذكرني.',
        'forgot-password' => 'هل نسيت كلمة السر ؟',
        'forgot-text' => 'ادخل بريدك الالكتروني و سيرسل اليك تعليمات لاعادة تعيين كلمة المرور الخاصة بك',
        'reset-password' => 'ضع كلمة مرور جديدة',
        'reset-message' => 'اعادة تعيين كلمة المرور',
        'reset-text' => 'يجب ان تكون كلمة مرورك الجديدة مختلفة عن كلمة المرور المستخدمة سابقا',
        'send-reset-link' => 'ارسال رابط اعادة التعيين',
    ],

    'models' => [
        'role' => '{1}الدور|[2,*]الأدوار',
        'permission' => '{1}الصلاحية|[2,*]الصلاحيات',
        'admin' => '{1}المدير|[2,*]المدراء',
        'setting' => '{1}الاعدادات|[2,*]الاعدادات',
        'account' => '{1}الحساب|[2,*]الحسابات',
        'notification'=> '{1}الإشعار|[2,*]الإشعارات',
        'user' => '{1}المستخدم|[2,*]المستخدمين',
        'offer' => '{1}الاعلان|[2,*]الاعلانات',
        'order' => '{1}الطلب|[2,*]الطلبات',
        'rate' => '{1}التقييم|[2.*]التقييمات',
        'image' => '{1}صورة|[2,*]صور',
        'section' =>  "{1}القسم|[2,*]الاقسام",
        'category' => '{1}الصنف|[2,*]الاصناف',
        'content' => '{1}المحتوى|[2.*]محتويات',
        'paragraph' => '{1}الفقرة|[2,*]الفقرات',
        'shared_background' => 'خلفية',
        'shared_backgrounds' => 'خلفيات المشاركة',
        'language' => '{1}اللغات|[2.*]لغة',
        'margin' => '{1}الهوامش|[2.*]الهامش',
        'keywords'=>'الكلمات المفتاحية'
    ],

    'fields' => [
        'email' => 'البريد الالكتروني',
        'password' => 'كلمة مرور',
        'password_confirmation' => 'تاكيد كلمة المرور',
        'first_name' => 'الاسم',
        'last_name' => 'اللقب',
        'name' => 'الاسم',
        'title' => 'العنوان',
        'price' => 'السعر',
        'old_price' => 'السعر قديم',
        'description' => 'الوصف',
        'content' => 'المحتوى',
        'value' => 'القيمة',
        'slug' => 'السبيكة',
        'state' => 'الحالة',
        'expire_date' => 'تاريخ انتهاء الصلاحية',
        'start_date' => 'تاريخ البدء',
        'end_date' => 'تاريخ الانتهاء',
        'date' => 'التاريخ',
        'created_at' => 'أنشئت في',
        'updated at' => 'تم التحديث في',
        'code' => 'الرمز',
        'color' => 'اللون',
        'note' => 'الملاحظة',
        'amount' => 'مقدار',
        'discount' => 'خصم',
        'payment_method' => 'طريقة الدفع',
        'phone' => 'رقم الهاتف',
        'country_code' => 'رمز الدولة',
        'phone_2' => 'رقم الهاتف الثاني',
        'image' => 'صورة',
        'avatar' => 'الصورة الرمزية',
        'dashboard' => 'الرئيسيه',
        'keyword' => 'كلمة مفتاحية',

        'cost' => 'الكلفة',
        'sku' => 'SKU',
        'upc' => 'UPC',
        'sub_total' => 'المجموع الفرعي',
        'total' => 'المجموع',
        'qty' => 'QTY',
        'invoice' => 'فاتورة',
        'currency_code' => 'رمز العملة',
        'site_tax' => 'ضريبة الموقع',
        'min_order_amount' => 'المبلغ الأدنى للطلب',
        'image_size'     => 'حجم الصورة',
        'general' => 'عام',
        'privacy_policy' => 'سياسة الخصوصية',
        'driver_terms_of_use' => 'شروط الاستخدام الخاصة بالسائق',
        'user_terms_of_use' => 'شروط الاستخدام الخاصة بالمستخدم',
        'about_us' => 'معلومات عنا',
        'help' => 'المساعدة',
        'profile' => 'الملف الشخصي',
        'all' => 'الكل',
        'receivers' => 'المعنيين',
        'message' => 'رسالة',
        'general_settings' => 'الاعدادات العامة',
        'gender' => 'الجنس',
        'banned_to' => 'محظور الى',
        'ban' => 'الحظر',
        'car' => 'السيارة',
        'type' => 'الصنف',
        'car_images' => 'صور السيارة',
        'shifts' => 'نوبات',
        'people_count' => 'عدد الناس',
        'days_count' => 'عدد الأيام',
        'parent' => 'الأب',
        'voice' => 'الصوت',
        'start_from' => 'يبدأ من',
        'end_at' => 'ينتهي عند',
        'direction' => 'اتجاه',
        'rtl' => 'من اليمين الى اليسار',
        'author_and_source' => 'المصدر',
        'ltr' => 'من اليسار إلى اليمين',
        'terms' => 'مصطلحات',
        'main' => 'رئيسيه',
        'choose' => 'أختر',
        'display_type' => 'طريقه العرض',
    ],

    'permissions_models'=>[
        'role' => 'الأدوار',
        'admin' => 'المدراء',
        'settings' => 'الاعدادات',
        'admin-notification'=> 'الإشعارات',
        'section' =>  "الاقسام",
        'category' => 'الاصناف',
        'content' => 'المحتوى',
        'paragraph' => 'الفقرات',
        'shared-backgrounds' => 'خلفيات المشاركة',
        'language' => 'اللغات',
        'margin' => 'الهوامش',
        'section-keyword'=>'الكلمات المفتاحية (الاقسام)',
        'paragraph-keyword'=>'الكلمات المفتاحية (الفقرات)',
        'create'=>'اضافة سجل',
        'edit'=>'تعديل',
        'delete'=>'حذف',
        'view'=>'معاينة'
    ],


    'enum' => [
        'type' => [
            1 => 'المستخدم',
            2  => 'السائق'
        ],

        'state' => [
            1 => 'مفعل',
            2 => 'غير مفعل'
        ],
        'section' => [
            'state' => [
                2 => 'نشيط',
                1 => 'غير نشط',
            ],
            'type' => [
                1 => 'نص وبانر',
                2  => 'صوره'
            ],
        ],
        'category' => [
            'state' => [
                2 => 'نشيط',
                1 => 'غير نشط',
            ],
            'type' => [
                1 => 'نص وبانر',
                2  => 'صوره'
            ],
        ]
    ],

    'switchs' => [
        'enable_state' => [
            1 => 'تفعيل',
            2 => 'إلغاء التفعيل',
        ],
        'enable_color' => [
            1 => 'ناجح',
            2 => 'خطير'
        ]
    ],

    'langs' => [
        'en' => 'انجليزي',
        'ar' => 'عربي',
        'fr' => 'Fr',
    ],

];
