<?php

return [

    'flash' => [
        'create' => 'تم تسجيل السجل بنجاح',
        'update' => 'تم تحديث السجل بنجاح',
        'delete' => 'تم حذف السجل بنجاح',
        'payment_url' => 'تم إنشاء الرابط بنجاح',
        'failed' => 'اوبس ! حدث خطا ما. ارجوك اعد المحاولة لاحقا',
        'login_success' => 'مرحبا بعودتك :name',
        'success' => 'عمل ناجح',
        'error' => 'خطأ',
        'cant_add_duplicate' => 'لا يمكن تسجيل نفس البيانات مرتين'
    ],

    'static' => [
        'admin_login_welcome' => 'مرحبا بكم في ادارة Halfway',
        'admin_login_text'    => 'ارجوك سجل دخولك الى حسابك و ابدا الجلسة',
        'forgot_password'    => 'نسيت كلمة السر ؟ 🔒',
        'loading_text'    => 'يرجى الإنتظار...',
        'continue'    => 'واصل',
        'send'    => 'إرسال',
        'send-item'    => 'إرسال :name',
        'submit'    => 'إرسال',
        'reset' => 'اعادة التعيين',
        'clear'    => 'واضح',
        'search'    => 'بحث',
        'save'    => 'حفظ',
        'create'    => 'اضافة سجل جديد',
        'create-item'    => 'اضافة :name',
        'edit'    => 'تعديل',
        'edit-item'    => 'تعديل :name',
        'delete-item'    => 'حذف :name',
        'delete'    => 'حذف',
        'cancel'    => 'الغاء',
        'quick-add'    => 'إضافة سريعة',
        'back'    => 'رجوع',
        'back-to'    => 'ارجع الى :name',
        'mark-as'    => 'وضع علامة باسم :name',
        'actions'    => 'اجراءات',
        'filters' => 'المرشحات',
        'filter_options' => 'خيارات التصفية',
        'more' => 'مزيد ...',
        'total_user_with_role' => 'إجمالي المستخدمين مع الدور',
        'view-item' => 'معاينة :name',
        'view' => 'معاينة',
        'and' => 'و',
        'add-new' => 'اضف :name',
        'super_admin' => 'سوبر ادمن',
        'super_admin_text' => 'يسمح بالوصول الكامل إلى النظام',
        'select_all' => 'اختر الكل',

        'details' => 'التفاصيل',
        'allowed_files_types' => "أنواع الملفات المسموح بها: png, jpg, jpeg.",

        'delete_confirm_title' => 'هل انت متاكد ؟',
        'delete_confirm_text' => "لن تكون قادرا على التراجع عن هذا!",
        'delete_btn_yes' => 'نعم',
        'delete_btn_cancel' => 'الغاء',

        'selected' => 'المحدد',
        'delete_selected' => 'احذف المختار',

        'add-attribute' => 'اضف ميزة',
        'accounts' => 'حسابات',
        'product_management' => 'ادارة المنتج',
        'invoices' => 'الفواتير',

        'forgot_password_message' => 'Change your password in three easy steps. This helps to keep your new password
        secure.',

        'enter_your_email' => 'أدخل عنوان بريدك الالكتروني',
        'reset_message' => 'اعادة تعيين كلمة المرور 🔒',
        'reset_text' => 'يجب ان تكون كلمة مرورك الجديدة مختلفة عن كلمة المرور المستخدمة سابقا',
        'shop' => 'متجر',
        'view_all' => 'مشاهدة الكل',
        'list' => 'قائمة :name',
        'offer_closed' => 'هذا العرض مغلق',
        'offer_action_forbidden' => 'لا يمكنك القيام بهذه العمليه انت لست المالك لهذا العرض',
        'order_must_accepted' => 'يجب أن يكون الطلب في حالة القبول',
        'your_offer' => "لا يمكنك تقديم طلب على عرضك",
        'order_user_must_driver' => "يمكن للسائق فقط إجراء هذه العملية",
        'no_margin_for_section' => "لا يوجد هوامش لهذا القسم",
        'invalid_section_description'=>'يرجى ادخال وصف صحيح',
        'invalid_section_name'=>'يرجى ادخال اسم صحيح'
    ],
];
